#### Terraform Format and Style :paintbrush: `success`
#### Terraform Initialization :gear: `success`
#### Terraform Plan :book:`success`
#### Terraform Validation :robot:`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/webstorm/pa-tsa-conference-app-api/runs/run-fMu79GrMQJDBYoN5

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_cosmosdb_account.pa_tsa_conference_cosmosdb will be created
  + resource "azurerm_cosmosdb_account" "pa_tsa_conference_cosmosdb" {
      + access_key_metadata_writes_enabled    = true
      + analytical_storage_enabled            = false
      + connection_strings                    = (sensitive value)
      + create_mode                           = (known after apply)
      + default_identity_type                 = "FirstPartyIdentity"
      + enable_automatic_failover             = false
      + enable_free_tier                      = false
      + enable_multiple_write_locations       = false
      + endpoint                              = (known after apply)
      + id                                    = (known after apply)
      + is_virtual_network_filter_enabled     = false
      + kind                                  = "MongoDB"
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + mongo_server_version                  = (known after apply)
      + name                                  = "pa-tsa-conference-cosmos"
      + network_acl_bypass_for_azure_services = false
      + offer_type                            = "Standard"
      + primary_key                           = (sensitive value)
      + primary_readonly_key                  = (sensitive value)
      + public_network_access_enabled         = true
      + read_endpoints                        = (known after apply)
      + resource_group_name                   = "pa-tsa-conference-app-api"
      + secondary_key                         = (sensitive value)
      + secondary_readonly_key                = (sensitive value)
      + write_endpoints                       = (known after apply)

      + capabilities {
          + name = "EnableMongo"
        }

      + capacity {
          + total_throughput_limit = 1000
        }

      + consistency_policy {
          + consistency_level       = "BoundedStaleness"
          + max_interval_in_seconds = 400
          + max_staleness_prefix    = 200000
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "eastus"
          + zone_redundant    = false
        }
    }

  # azurerm_cosmosdb_mongo_collection.conference_events_collection will be created
  + resource "azurerm_cosmosdb_mongo_collection" "conference_events_collection" {
      + account_name        = "pa-tsa-conference-cosmos"
      + database_name       = "conference-app-cosmosdb"
      + id                  = (known after apply)
      + name                = "conference-events"
      + resource_group_name = "pa-tsa-conference-app-api"
      + system_indexes      = (known after apply)
      + throughput          = (known after apply)

      + index {
          + keys   = [
              + "_id",
            ]
          + unique = true
        }
    }

  # azurerm_cosmosdb_mongo_database.conference_app_cosmosdb will be created
  + resource "azurerm_cosmosdb_mongo_database" "conference_app_cosmosdb" {
      + account_name        = "pa-tsa-conference-cosmos"
      + id                  = (known after apply)
      + name                = "conference-app-cosmosdb"
      + resource_group_name = "pa-tsa-conference-app-api"
      + throughput          = (known after apply)
    }

  # azurerm_linux_web_app.pa_tsa_conference_app_api will be created
  + resource "azurerm_linux_web_app" "pa_tsa_conference_app_api" {
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "eastus"
      + name                              = "pa-tsa-conference-app-api-app"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "pa-tsa-conference-app-api"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)
        }
    }

  # azurerm_resource_group.pa_tsa_conference_app_api_rg will be created
  + resource "azurerm_resource_group" "pa_tsa_conference_app_api_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "pa-tsa-conference-app-api"
    }

  # azurerm_service_plan.pa_tsa_conference_app_api will be created
  + resource "azurerm_service_plan" "pa_tsa_conference_app_api" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "pa-tsa-conference-app-api-asp"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "pa-tsa-conference-app-api"
      + sku_name                     = "B1"
      + worker_count                 = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>